tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "codeclimate/formulae"
tap "github/bootstrap"
tap "github/gh"
tap "github/packages"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Library for command-line editing
brew "readline"
# GNU multiple precision arithmetic library
brew "gmp"
# Cross-platform make
brew "cmake"
# Dependency Manager for PHP
brew "composer"
# Diff your Docker containers
brew "container-diff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# International domain name library
brew "libidn"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy", link: false
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Create Docker hosts locally and on cloud providers
brew "docker-machine", link: false
# Tool for managing dock items
brew "dockutil"
# Distributed search & analytics engine
brew "elasticsearch@2.4", restart_service: true
# CLI tool for quick access to files and directories
brew "fasd"
# Generic library support script
brew "libtool"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# GPG key agent
brew "gpg-agent"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Numerical library for C and C++
brew "gsl"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# The mind to rule processes of your development environment
brew "hivemind"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# High-performance regular expression matching library
brew "hyperscan"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Bind to privileged ports without running a server as root
brew "launch_socket_server", restart_service: true
# Mini DNS server designed solely to route queries to localhost
brew "launchdns", restart_service: true
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Conversion library
brew "libiconv"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# YAML Parser
brew "libyaml"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum", link: false
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# Simple tool to make locally trusted development certificates
brew "mkcert"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql@5.7", restart_service: true
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Manage compile and link flags for libraries
brew "pkg-config"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Display the PID number for a given process name
brew "pidof"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Perl 6 compiler
brew "rakudo-star"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Make rbenv aware of bundler binstubs
brew "rbenv-binstubs"
# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# HTTP regression testing and benchmarking utility
brew "siege"
# SOcket CAT: netcat on steroids
brew "socat"
# Cryptographic store accessible through a PKCS#11 interface
brew "softhsm"
# Utility to modify the macOS Accessibility Database (TCC.db)
brew "tccutil"
# Code-search similar to ack
brew "the_silver_searcher"
# Clean up files in directories based on their age
brew "tmpreaper"
# Language for application scale JavaScript development
brew "typescript"
# Manipulate and analyze Unicode text
brew "uniutils"
# Internet file retriever
brew "wget"
# Translate common Internet acronyms
brew "wtf"
# Linter for YAML files
brew "yamllint", link: false
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Code Climate CLI
brew "codeclimate/formulae/codeclimate"
# Kubernetes command-line interface
brew "github/bootstrap/kubectl@1.14"
# Template-free customization of Kubernetes YAML manifests
brew "github/bootstrap/kustomize@2.0"
# GitHub CLI
brew "github/gh/gh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
cask "1password"
cask "adobe-acrobat-reader"
cask "docker"
cask "dropbox"
cask "encryptme"
cask "font-inconsolata"
cask "font-league-gothic"
cask "font-open-sans"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "google-chrome-beta"
cask "gpg-suite"
cask "graphiql"
cask "graphql-playground"
cask "insomnia"
cask "iterm2-beta"
cask "java"
cask "karabiner-elements"
cask "keybase"
cask "logitech-options"
cask "paw"
cask "prey"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quickgeojson"
cask "quicklook-csv"
cask "quicklook-json"
cask "skitch"
cask "slack-beta"
cask "spotify"
cask "steam"
cask "virtualbox"
cask "viscosity"
cask "visual-studio-code"
cask "zoomus"
mas "24 Hour Wallpaper", id: 1226087575
mas "Calca", id: 635758264
mas "Colors for Hue", id: 581915465
mas "GIF Brewery 3", id: 1081413713
mas "Keynote", id: 409183694
mas "Thessa", id: 942305623
mas "Twitter", id: 1482454543
