tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "github/bootstrap"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"
cask "caskroom/versions/java8"
brew "ack"
brew "automake"
brew "cask"
brew "cmake"
brew "curl"
brew "diff-so-fancy"
brew "docker"
brew "docker-machine"
brew "dockutil"
brew "elasticsearch@2.4", restart_service: true
brew "fasd"
brew "ghi"
brew "git"
brew "git-lfs"
brew "go"
brew "glide"
brew "gmp"
brew "gnupg", link: false
brew "gpg-agent"
brew "grc"
brew "node"
brew "heroku"
brew "hub"
brew "hyperscan"
brew "libtool"
brew "imagemagick"
brew "jansson"
brew "jq"
brew "launch_socket_server", restart_service: true
brew "launchdns", restart_service: true
brew "lcov"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "mackup"
brew "mas"
brew "md5sha1sum"
brew "memcached", restart_service: true
brew "mtr"
brew "mysql", restart_service: true
brew "nginx", restart_service: true
brew "node-build"
brew "nodenv"
brew "pandoc"
brew "pidof"
brew "pinentry-mac"
brew "ruby-build"
brew "rbenv"
brew "rbenv-binstubs"
brew "rbenv-default-gems"
brew "redis", restart_service: true
brew "ruby"
brew "shellcheck"
brew "siege"
brew "socat"
brew "softhsm"
brew "tccutil"
brew "the_silver_searcher"
brew "tmpreaper"
brew "wget"
brew "zsh"
cask "1password"
cask "android-platform-tools"
cask "dropbox"
cask "encryptme"
cask "gimp"
cask "google-hangouts"
cask "gpg-suite"
cask "java"
cask "karabiner-elements"
cask "keybase"
cask "libreoffice"
cask "paw"
cask "prey"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quickgeojson"
cask "quicklook-csv"
cask "quicklook-json"
cask "skitch"
cask "sling"
cask "spotify"
cask "steam"
cask "viscosity"
cask "vlc"
cask "zoomus"
cask "caskroom/drivers/logitech-options"
cask "caskroom/drivers/yubico-authenticator"
cask "caskroom/fonts/font-inconsolata"
cask "caskroom/fonts/font-league-gothic"
cask "caskroom/fonts/font-open-sans"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-source-sans-pro"
cask "caskroom/versions/atom-beta"
cask "caskroom/versions/google-chrome-beta"
cask "caskroom/versions/iterm2-beta"
cask "caskroom/versions/slack-beta"
mas "Calca", id: 635758264
mas "Colors", id: 581915465
mas "GarageBand", id: 682658836
mas "GIF Brewery 3", id: 1081413713
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magic Window", id: 432840866
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Thessa", id: 942305623
mas "Tweetbot", id: 557168941
mas "TweetDeck", id: 485812721
