tap "artginzburg/tap"
tap "cloudflare/cloudflare"
tap "github/bootstrap"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "pothosware/pothos"
tap "shopify/shopify"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# GNU multiple precision arithmetic library
brew "gmp"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Software library to render fonts
brew "freetype"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# YAML Parser
brew "libyaml"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy", restart_service: :changed
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for managing dock items
brew "dockutil"
# Read, write, modify, and display EXIF data on the command-line
brew "exif"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Declarative configuration for Gmail filters
brew "gmailctl"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Numerical library for C and C++
brew "gsl"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# SoapySDR RTL-SDR Support Module
brew "soapyrtlsdr"
# SDK for signal processing blocks to implement software radios
brew "gnuradio"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Low cost software radio platform
brew "hackrf"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Process manager for Procfile-based applications
brew "hivemind"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Convert images to PDF via direct JPEG inclusion
brew "img2pdf"
# Offline radio signal analyser
brew "inspectrum"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# JSON diff and patch
brew "jd"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Development kit for the Java programming language
brew "openjdk@17"
# Style and grammar checker
brew "languagetool", restart_service: :changed
# Linear Algebra PACKage
brew "lapack"
# Platform built on V8 to build network applications
brew "node"
# Tool for managing JavaScript projects with multiple packages
brew "lerna"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Python implementation for microcontrollers and constrained systems
brew "micropython"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Port scanning utility for large networks
brew "nmap"
# Install NodeJS versions
brew "node-build"
# Node.js version manager
brew "nodenv"
# Find newer versions of dependencies than what your package.json allows
brew "npm-check-updates"
# Libraries for security-enabled client and server applications
brew "nss"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Open source suite of directory software
brew "openldap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Program to decode radio transmissions from devices
brew "rtl_433"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# SDL2 graphics drawing primitives and other support functions
brew "sdl2_gfx"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Small sample cross-platform networking library
brew "sdl2_net"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Autoformat shell script source code
brew "shfmt"
# HTTP regression testing and benchmarking utility
brew "siege"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Version control system designed to be a better CVS
brew "subversion"
# Detect compliance and security violations across Infrastructure as Code
brew "terrascan"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Code-search similar to ack
brew "the_silver_searcher"
# Clean up files in directories based on their age
brew "tmpreaper"
# Language for application scale JavaScript development
brew "typescript"
# Universal Radio Hacker
brew "urh"
# Syntax-aware linter for prose
brew "vale"
# Image processing library
brew "vips"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Utility to export your existing Cloudflare resources as Terraform resources
brew "cloudflare/cloudflare/cf-terraforming"
# Soapy SDR plugin for Hack RF
brew "pothosware/pothos/soapyhackrf"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Android SDK component
cask "android-platform-tools"
# Inspect application bundles
cask "apparency"
# USB 3.0 to gigabit ethernet drivers for ASIX Electronics devices
cask "asix-ax88179"
# Two-factor authentication software
cask "authy"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Control your Elgato key lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github@beta"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your emails and files
cask "gpg-suite"
# Software-defined radio receiver powered by GNU Radio and Qt
cask "gqrx"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2@beta"
# Keyboard customiser
cask "karabiner-elements"
# Grammar, spelling and style suggestions in all the writing apps
cask "languagetool-desktop"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Software for Logitech devices
cask "logi-options+"
# Screen and video recording software
cask "loom"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Cross-platform MQTT 5.0 Desktop Client
cask "mqttx"
# Small, simple editor for beginner Python programmers
cask "mu-editor"
# Toggle mute, video, record, share, and leave a meeting in a call app
cask "mutedeck"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Network utility for sending / receiving TCP, UDP, SSL
cask "packetsender"
# Extracts pages, splits, merges, mixes and rotates PDF files
cask "pdfsam-basic"
# Companion app for Flipper Zero devices
cask "qflipper"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for GeoJSON and TopoJSON
cask "quickgeojson"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Screenshot measurement and annotation tool
cask "shottr"
# Qt-based digital signal analyzer
cask "sigdigger"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack@beta"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Application for inspecting installer packages
cask "suspicious-package"
# Python IDE for beginners
cask "thonny"
# Mutes your keyboard while you type
cask "unclack"
# Management tool for Unity
cask "unity-hub"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "24 Hour Wallpaper", id: 1226087575
mas "AdGuard for Safari", id: 1440147259
mas "Dark Reader for Safari", id: 1438243180
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "feedly", id: 865500966
mas "GhostText", id: 1552641506
mas "Hush", id: 1544743900
mas "HyperList", id: 0
mas "iMovie", id: 408981434
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LanguageTool", id: 1534275760
mas "MeetingBar", id: 1532419400
mas "Meshtastic", id: 1586432531
mas "Okta Extension App", id: 1439967473
mas "Open In Webmail", id: 1451552749
mas "PayPal Honey", id: 1472777122
mas "reMarkable", id: 1276493162
mas "RetailMeNot Codes & Cash Back", id: 1588381926
mas "Ring", id: 1142753258
mas "StopTheMadness", id: 1376402589
mas "Super Agent", id: 1568262835
mas "TestFlight", id: 899247664
mas "URL Linker", id: 1289119450
mas "Wayback Machine", id: 1472432422
mas "WhatsApp", id: 310633997
mas "WhatsApp (old)", id: 1147396723
vscode "1password.op-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-workspace"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "kargware.vscode-extension-jekyll-kw"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "neilding.language-liquid"
vscode "nicoespeon.abracadabra"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "shopify.theme-check-vscode"
vscode "sissel.shopify-liquid"
vscode "visualstudiotoolsforunity.vstuc"
vscode "yzhang.markdown-all-in-one"
