# frozen_string_literal: true

tap 'artginzburg/tap'
tap 'cloudflare/cloudflare'
tap 'github/bootstrap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'pothosware/pothos'
tap 'shopify/shopify'
# Search tool like grep, but optimized for programmers
brew 'ack'
# Run your GitHub Actions locally
brew 'act'
# Static checker for GitHub Actions workflow files
brew 'actionlint'
# Software library to render fonts
brew 'freetype'
# Cryptography and SSL/TLS Toolkit
brew 'openssl@3'
# Library for command-line editing
brew 'readline'
# OpenType text shaping engine
brew 'harfbuzz'
# Library to render SVG files using Cairo
brew 'librsvg'
# C library SSHv1/SSHv2 client and server protocols
brew 'libssh'
# YAML Parser
brew 'libyaml'
# Automate deployment, configuration, and upgrading
brew 'ansible'
# Checks ansible playbooks for practices and behaviour
brew 'ansible-lint'
# GNU multiple precision arithmetic library
brew 'gmp'
# Generic library support script
brew 'libtool'
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew 'asdf'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.11'
# Microsoft Azure CLI 2.0
brew 'azure-cli'
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew 'caddy', restart_service: true
# Statistics utility to count lines of code
brew 'cloc'
# Cross-platform make
brew 'cmake'
# Platform built on V8 to build network applications
brew 'node'
# C library implementing the SSH2 protocol
brew 'libssh2'
# Get a file from an HTTP, HTTPS or FTP server
brew 'curl'
# Open source suite of directory software
brew 'openldap'
# Good-lookin' diffs with diff-highlight and more
brew 'diff-so-fancy'
# Tool for managing dock items
brew 'dockutil'
# Command-line DNS client
brew 'dog'
# Read, write, modify, and display EXIF data on the command-line
brew 'exif'
# Perl lib for reading and writing EXIF metadata
brew 'exiftool'
# GNU Transport Layer Security (TLS) Library
brew 'gnutls'
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew 'sdl2'
# Command-line fuzzy finder written in Go
brew 'fzf'
# GitHub command-line tool
brew 'gh'
# Distributed revision control system
brew 'git'
# Git extension for versioning large files
brew 'git-lfs'
# Declarative configuration for Gmail filters
brew 'gmailctl'
# GNU implementation of the famous stream editor
brew 'gnu-sed'
# Passphrase entry dialog utilizing the Assuan protocol
brew 'pinentry'
# GNU Pretty Good Privacy (PGP) package
brew 'gnupg'
# Manage compile and link flags for libraries
brew 'pkg-config'
# Numerical library for C and C++
brew 'gsl'
# Optimized BLAS library
brew 'openblas'
# Package for scientific computing with Python
brew 'numpy'
# SoapySDR RTL-SDR Support Module
brew 'soapyrtlsdr'
# SDK for signal processing blocks to implement software radios
brew 'gnuradio'
# Open source programming language to build simple/reliable/efficient software
brew 'go'
# Ping, but with a graph
brew 'gping'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.10'
# Colorize logfiles and command output
brew 'grc'
# GNU grep, egrep and fgrep
brew 'grep'
# Low cost software radio platform
brew 'hackrf'
# Smarter Dockerfile linter to validate best practices
brew 'hadolint'
# Process manager for Procfile-based applications
brew 'hivemind'
# User-friendly cURL replacement (command-line HTTP client)
brew 'httpie'
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew 'libheif'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.9'
# Tools and libraries to manipulate images in many formats
brew 'imagemagick'
# Convert images to PDF via direct JPEG inclusion
brew 'img2pdf'
# Offline radio signal analyser
brew 'inspectrum'
# Tool to measure maximum TCP and UDP bandwidth
brew 'iperf'
# JSON diff and patch
brew 'jd'
# Implementation of malloc emphasizing fragmentation avoidance
brew 'jemalloc'
# Command-line pager for JSON data
brew 'jless'
# Lightweight and flexible command-line JSON processor
brew 'jq'
# Domain specific configuration language for defining JSON data
brew 'jsonnet'
# Linear Algebra PACKage
brew 'lapack'
# Tool for managing JavaScript projects with multiple packages
brew 'lerna'
# Keep your Mac's application settings in sync
brew 'mackup'
# Mac App Store command-line interface
brew 'mas'
# Development kit for the Java programming language
brew 'openjdk'
# Java-based project management
brew 'maven'
# Protocol buffers (Google's data interchange format)
brew 'protobuf'
# Intercept, modify, replay, save HTTP/S traffic
brew 'mitmproxy'
# 'traceroute' and 'ping' in a single tool
brew 'mtr'
# Port scanning utility for large networks
brew 'nmap'
# Libraries for security-enabled client and server applications
brew 'nss'
# Adds an OCR text layer to scanned PDF files
brew 'ocrmypdf'
# Swiss-army knife of markup format conversion
brew 'pandoc'
# Pinentry for GPG on Mac
brew 'pinentry-mac'
# Python dependency management tool
brew 'pipenv'
# Execute binaries from Python packages in isolated environments
brew 'pipx'
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew 'prettier'
# Python interface to Tcl/Tk
brew 'python-tk@3.9'
# Install various Ruby versions and implementations
brew 'ruby-build'
# Ruby version manager
brew 'rbenv'
# Program to decode radio transmissions from devices
brew 'rtl_433'
# Powerful, clean, object-oriented scripting language
brew 'ruby'
# Safe, concurrent, practical language
brew 'rust'
# SDL2 graphics drawing primitives and other support functions
brew 'sdl2_gfx'
# Library for loading images as SDL surfaces and textures
brew 'sdl2_image'
# Sample multi-channel audio mixer library
brew 'sdl2_mixer'
# Small sample cross-platform networking library
brew 'sdl2_net'
# Library for using TrueType fonts in SDL applications
brew 'sdl2_ttf'
# Static analysis and lint tool, for (ba)sh scripts
brew 'shellcheck'
# Autoformat shell script source code
brew 'shfmt'
# HTTP regression testing and benchmarking utility
brew 'siege'
# Command-line interface for https://speedtest.net bandwidth tests
brew 'speedtest-cli'
# Version control system designed to be a better CVS
brew 'subversion'
# Tool to build, change, and version infrastructure
brew 'terraform'
# Detect compliance and security violations across Infrastructure as Code
brew 'terrascan'
# Enables extra languages support for Tesseract
brew 'tesseract-lang'
# Linter for Terraform files
brew 'tflint'
# Static analysis security scanner for your terraform code
brew 'tfsec'
# Code-search similar to ack
brew 'the_silver_searcher'
# Clean up files in directories based on their age
brew 'tmpreaper'
# Language for application scale JavaScript development
brew 'typescript'
# Universal Radio Hacker
brew 'urh'
# Syntax-aware linter for prose
brew 'vale'
# Image processing library
brew 'vips'
# Convert HTML to PDF
brew 'weasyprint'
# Internet file retriever
brew 'wget'
# Linter for YAML files
brew 'yamllint'
# JavaScript package manager
brew 'yarn'
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew 'yq'
# Shell extension to navigate your filesystem faster
brew 'zoxide'
# UNIX shell (command interpreter)
brew 'zsh'
# Permanent TouchID support for sudo
brew 'artginzburg/tap/sudo-touchid'
# Soapy SDR plugin for Hack RF
brew 'pothosware/pothos/soapyhackrf'
# A CLI tool to build for the Shopify platform
brew 'shopify/shopify/shopify-cli'
# Password manager that keeps all passwords secure behind one password
cask '1password'
# Command-line interface for 1Password
cask '1password-cli'
# Stand alone ad blocker
cask 'adguard'
# Android SDK component
cask 'android-platform-tools'
# Two-factor authentication software
cask 'authy'
# Use your phone as a high-quality webcam with image tuning controls
cask 'camo-studio'
# Utility to export your existing Cloudflare resources as Terraform resources
cask 'cf-terraforming'
# Clipboard manager
cask 'copyclip'
# App to build and share containerised applications and microservices
cask 'docker'
# Client for the Dropbox cloud storage service
cask 'dropbox'
# Control your Elgato key lights
cask 'elgato-control-center'
# Assign keys, and then decorate and label them
cask 'elgato-stream-deck'
cask 'font-hack-nerd-font'
# Free and open-source image editor
cask 'gimp'
# Desktop client for GitHub repositories
cask 'github@beta'
# Web browser
cask 'google-chrome'
# Client for the Google Drive storage service
cask 'google-drive'
# Tools to protect your emails and files
cask 'gpg-suite'
# Software-defined radio receiver powered by GNU Radio and Qt
cask 'gqrx'
# Light, Electron-based Wrapper around GraphiQL
cask 'graphiql'
# Terminal emulator as alternative to Apple's Terminal app
cask 'iterm2@beta'
# Keyboard customiser
cask 'karabiner-elements'
# End-to-end encryption software
cask 'keybase'
# Interface for reading and syncing eBooks
cask 'kindle'
# Free cross-platform office suite, fresh version
cask 'libreoffice'
# Provides access to camera controls
cask 'logitech-camera-settings'
# Software for Logitech devices
cask 'logitech-options'
# Full TeX Live distribution with GUI applications
cask 'mactex'
# Provides updates to various Microsoft products
cask 'microsoft-auto-update'
# Web browser
cask 'microsoft-edge'
# Office suite
cask 'microsoft-office'
# Meet, chat, call, and collaborate in just one place
cask 'microsoft-teams'
# Minimal installer for conda
cask 'miniconda'
# Cross-platform MQTT 5.0 Desktop Client
cask 'mqttx'
# Small, simple editor for beginner Python programmers
cask 'mu-editor'
# Unofficial desktop client for F1TV
cask 'multiviewer-for-f1'
# Open-source software for live streaming and screen recording
cask 'obs'
# Knowledge base that works on top of a local folder of plain text Markdown files
cask 'obsidian'
# Network utility for sending / receiving TCP, UDP, SSL
cask 'packetsender'
# Quick Look plug-in that renders source code with syntax highlighting
cask 'qlcolorcode'
# Display image info and preview unsupported formats in QuickLook
cask 'qlimagesize'
# Quick Look generator for Markdown files
cask 'qlmarkdown'
# Quick Look plugin for plaintext files without an extension
cask 'qlstephen'
# Quick Look plugin for GeoJSON and TopoJSON
cask 'quickgeojson'
# Quick Look plugin for CSV files
cask 'quicklook-csv'
# Quick Look plugin for JSON files
cask 'quicklook-json'
# Imaging utility to install operating systems to a microSD card
cask 'raspberry-pi-imager'
# Screenshot measurement and annotation tool
cask 'shottr'
# Qt-based digital signal analyzer
cask 'sigdigger'
# Instant messaging application focusing on security
cask 'signal'
# Team communication and collaboration software
cask 'slack@beta'
# Music streaming service
cask 'spotify'
# Video game digital distribution service
cask 'steam'
# Mutes your keyboard while you type
cask 'unclack'
# Open-source code editor
cask 'visual-studio-code'
# HTML to PDF renderer
cask 'wkhtmltopdf'
# Application for generating TOTP and HOTP codes
cask 'yubico-authenticator'
# Video communication and virtual meeting platform
cask 'zoom'
mas '1Password for Safari', id: 1_569_813_296
mas '24 Hour Wallpaper', id: 1_226_087_575
mas 'AdGuard for Safari', id: 1_440_147_259
mas 'Dark Reader for Safari', id: 1_438_243_180
mas 'DuckDuckGo Privacy for Safari', id: 1_482_920_575
mas 'feedly', id: 865_500_966
mas 'GhostText', id: 1_552_641_506
mas 'GIF Brewery 3', id: 1_081_413_713
mas 'Hush', id: 1_544_743_900
mas 'iMovie', id: 408_981_434
mas 'JSONPeep', id: 1_458_969_831
mas 'Keynote', id: 409_183_694
mas 'MeetingBar', id: 1_532_419_400
mas 'Okta Extension App', id: 1_439_967_473
mas 'Open In Webmail', id: 1_451_552_749
mas 'PayPal Honey', id: 1_472_777_122
mas 'reMarkable', id: 1_276_493_162
mas 'RetailMeNot Deal Finder™️', id: 1_588_381_926
mas 'Ring', id: 1_142_753_258
mas 'StopTheMadness', id: 1_376_402_589
mas 'Super Agent', id: 1_568_262_835
mas 'TestFlight', id: 899_247_664
mas 'URL Linker', id: 1_289_119_450
mas 'Wayback Machine', id: 1_472_432_422
mas 'WhatsApp', id: 1_147_396_723
vscode '1password.op-vscode'
vscode 'coenraads.bracket-pair-colorizer'
vscode 'davidlday.languagetool-linter'
vscode 'github.codespaces'
vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'github.vscode-github-actions'
vscode 'github.vscode-pull-request-github'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode-remote.remote-wsl'
vscode 'ms-vscode-remote.vscode-remote-extensionpack'
vscode 'ms-vscode.makefile-tools'
vscode 'ms-vscode.remote-explorer'
vscode 'ms-vscode.remote-server'
vscode 'streetsidesoftware.code-spell-checker'
